//=============================================================================
//
// 攻撃範囲タイプ1 [attack_1.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _ATTACK_1_H_
#define _ATTACK_1_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "attack.h"
#include "scene.h"

//=============================================================================
// クラス定義
//=============================================================================
class CAttack1 : public CAttackBased
{
public:
	//関数定義
	CAttack1();
	~CAttack1();
	static CAttack1 *Create(D3DXVECTOR3 pos);
	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
private:
};
#endif