//=============================================================================
//
// chara_slectヘッダ [chara_slect.h]
// Author : 増澤 未来
//
//=============================================================================

//二重インクルード防止
#ifndef _CHARA_SELECT_H_
#define _CHARA_SELECT_H_

//*****************************
//インクルード
//*****************************
#include "scene.h"

//=============================
// 前方宣言
//=============================

//*****************************
//マクロ定義
//*****************************

//*****************************
//クラス定義
//*****************************

//ゲームクラス
class CCharaSelect : public CScene
{
public:
	//*****************************
	// 列挙定義
	//*****************************

	//*****************************
	// メンバ関数
	//*****************************
	CCharaSelect();
	~CCharaSelect();

	static CCharaSelect *Create(void); // クラス生成

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画
private:

	//*****************************
	// メンバ変数
	//*****************************
};

#endif