////////////////////////////////////////////////////
//
//    キャラ選択クラスの処理[chara_select.cpp]
//    Author:増澤 未来
//
////////////////////////////////////////////////////

//=============================
// インクルード
//=============================
#include "chara_select.h"

//=============================
// マクロ定義
//=============================

//=============================
// 静的メンバ変数宣言
//=============================

//=============================
// コンストラクタ
//=============================
CCharaSelect::CCharaSelect()
{
	// 変数のクリア
}

//=============================
// デストラクタ
//=============================
CCharaSelect::~CCharaSelect()
{
}

//=============================
// クリエイト
//=============================
CCharaSelect * CCharaSelect::Create(void)
{
	// メモリの確保
	CCharaSelect *pGame = new CCharaSelect;
	// 初期化
	pGame->Init();

	return pGame;
}

//=============================
// 初期化処理
//=============================
HRESULT CCharaSelect::Init(void)
{

	return S_OK;
}

//=============================
// 終了処理
//=============================
void CCharaSelect::Uninit(void)
{
	// 開放処理
	Release();
}

//=============================
// 更新処理
//=============================
void CCharaSelect::Update(void)
{

}

//=============================
// 描画処理
//=============================
void CCharaSelect::Draw(void)
{
}