//=============================================================================
//
// ゲーム開始の処理 [game_start.h]
// Author : 佐藤颯紀
//
//=============================================================================
#ifndef _GAME_START_H_
#define _GAME_START_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPolygon;
//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// クラス宣言
//=============================================================================
class CGame_Start :public CScene
{
public:
	// UIの種類
	typedef enum
	{
		TYPE_START_READEY = 0,
		TYPE_START_GO,
		TYPE_START_MAX
	}TYPE_START;

	CGame_Start();						// コンストラクタ
	~CGame_Start();						// デストラクタ

	static CGame_Start*Create(D3DXVECTOR3 pos, D3DXVECTOR3 size,TYPE_START type);	// 生成処理

	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 終了処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理

private:
	CPolygon*   m_pPolygon;		// ライフ描画用のポリゴン
	D3DXVECTOR3 m_pos;			// 位置
	D3DXVECTOR3 m_size;			// サイズ
	D3DXCOLOR   m_col;			// カラー
	int			m_nCount;		// カウント
	TYPE_START  m_type;			// UIのタイプ
	bool   m_bStart;			// スタートの可否
};
#endif // !_GAME_START_H_
