//=============================================================================
//
// キラキラ✧エフェクト [glitter_effect.h]
// Author : 吉田 悠人
//
//=============================================================================

//二重インクルード防止
#ifndef _GLITTER_EFFECT_H_
#define _GLITTER_EFFECT_H_

//*****************************
// インクルード
//*****************************
#include "billboard.h"
//*****************************
//前方宣言
//*****************************

//*****************************
//マクロ定義
//*****************************

//*****************************
// クラス定義
//*****************************
class CGlitter : public CBillboard
{
public:
	//*****************************
	//メンバ関数
	//*****************************
	CGlitter();
	~CGlitter();

	static void Create(D3DXVECTOR3 pos,int nLife ,D3DXCOLOR col);	//生成処理

	HRESULT Init(void);
	void Update(void);

private:
	void SizeChange(void);	// 大きさ設定
	void LifeDown(void);	// ライフを下げる処理

	//*****************************
	// メンバ変数
	//*****************************
	float  m_fLife;		// ライフ
	float  m_fMidpoint;	// サイズが変わるまでのフレーム数 
	int	 m_nSizeFps;	// サイズのフレームカウント
	bool m_bDeath;		// 死亡フラグ
};
#endif