//=============================================================================
//
// stage_slectヘッダ [stage_slect.h]
// Author : 増澤 未来
//
//=============================================================================

//二重インクルード防止
#ifndef _STAGE_SELECT_H_
#define _STAGE_SELECT_H_

//*****************************
//インクルード
//*****************************
#include "scene.h"
//=============================
// 前方宣言
//=============================

//*****************************
//マクロ定義
//*****************************

//*****************************
//クラス定義
//*****************************

//ゲームクラス
class CStageSelect : public CScene
{
public:
	//*****************************
	// メンバ関数
	//*****************************
	CStageSelect();
	~CStageSelect();

	static CStageSelect *Create(void); // クラス生成

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画

private:
};

#endif