////////////////////////////////////////////////////
//
//    キャラ選択クラスの処理[chara_select.cpp]
//    Author:増澤 未来
//
////////////////////////////////////////////////////

//=============================
// インクルード
//=============================
#include "stage_select.h"

//=============================
// マクロ定義
//=============================

//=============================
// 静的メンバ変数宣言
//=============================

//=============================
// コンストラクタ
//=============================
CStageSelect::CStageSelect()
{
}

//=============================
// デストラクタ
//=============================
CStageSelect::~CStageSelect()
{
}

//=============================
// クリエイト
//=============================
CStageSelect * CStageSelect::Create(void)
{
	// メモリの確保
	CStageSelect *pMode = new CStageSelect;
	// 初期化
	pMode->Init();

	return pMode;
}

//=============================
// 初期化処理
//=============================
HRESULT CStageSelect::Init(void)
{
	return S_OK;
}

//=============================
// 終了処理
//=============================
void CStageSelect::Uninit(void)
{
	// 開放処理
	Release();
}

//=============================
// 更新処理
//=============================
void CStageSelect::Update(void)
{
}

//=============================
// 描画処理
//=============================
void CStageSelect::Draw(void)
{
}